In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.DataFrame({'gender' : ['male', 'female','male', 'female','male', np.nan], 'age' : [16, 18,22, 19,25, 30], 'country' : ['india', 'china','russia', 'usa','france', 'canada']})
data.head(6)

   gender  age country
0    male   16   india
1  female   18   china
2    male   22  russia
3  female   19     usa
4    male   25  france
5     NaN   30  canada

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   gender   5 non-null      object
 1   age      6 non-null      int64
 2   country  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [4]:
# Label Encoder 
# Assign unique label to each categorie 
# gender - male, female -> 0, 1

# Label Encoder

In [5]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder

In [6]:
Le = LabelEncoder()
data['gender_transformed'] = Le.fit_transform(data['gender'])

In [7]:
Le = LabelEncoder()
data['country_transformed'] = Le.fit_transform(data['country'])

In [8]:
data.head(6)

   gender  age country  gender_transformed  country_transformed
0    male   16   india                   1                    3
1  female   18   china                   0                    1
2    male   22  russia                   1                    4
3  female   19     usa                   0                    5
4    male   25  france                   1                    2
5     NaN   30  canada                   2                    0

In [9]:
data["Inverse_transform"]=Le.inverse_transform(data['gender_transformed'])

In [10]:
data["Inverse_transform"]

0     china
1    canada
2     china
3    canada
4     china
5    france
Name: Inverse_transform, dtype: object

# One Hot Encoder

In [29]:
data1 = pd.DataFrame({'gender' : ['male', 'female','male', 'female','male', np.nan], 'age' : [16, 18,22, 19,25, 30], 'country' : ['india', 'china','russia', 'usa','france', 'canada']})
data1.head(6)

   gender  age country
0    male   16   india
1  female   18   china
2    male   22  russia
3  female   19     usa
4    male   25  france
5     NaN   30  canada

In [30]:
Ohe = OneHotEncoder(sparse = False)
Ohe.fit_transform(data1[['country']])

array([[0., 0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0.],
       [0., 0., 0., 0., 0., 1.],
       [0., 0., 1., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0.]])

In [31]:
Ohe.categories_[0]

array(['canada', 'china', 'france', 'india', 'russia', 'usa'],
      dtype=object)

In [32]:
def ApplyOneHotEncoder(data, col):
    Ohe = OneHotEncoder(sparse = False)
    encodings = Ohe.fit_transform(data[[col]])[:, 1:]
    encodings = pd.DataFrame(encodings, columns = Ohe.categories_[0][1:], dtype = int)
    data = pd.concat([data, encodings], axis = 1)
    return data

In [33]:
data1 = ApplyOneHotEncoder(data1, 'country')

In [34]:
data1

   gender  age country  china  france  india  russia  usa
0    male   16   india      0       0      1       0    0
1  female   18   china      1       0      0       0    0
2    male   22  russia      0       0      0       1    0
3  female   19     usa      0       0      0       0    1
4    male   25  france      0       1      0       0    0
5     NaN   30  canada      0       0      0       0    0